{
    "e981191b-7cc8-4cdb-b852-fa3bf88a1c72": "Multi-digit addition involves adding numbers with two or more digits by aligning them place-wise (ones, tens, hundreds, etc.) and carrying over when needed. The process starts from the rightmost digit and moves left, ensuring accurate summation. Proper place value alignment and regrouping help simplify calculations.",
    "f2f5f048-2abc-4c41-b5b2-38506c0fded7": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742917418/materials/materials/62cf9adc-c3ca-4b99-b1f7-1cdb26967a5a.mp4",
    "7943514b-dd97-45ac-89cc-12698cab0817": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742918113/materials/materials/aaf8339f-623b-4656-8cb9-cbc88a707920.mp4",
    "6eace064-3fbc-4c56-9daf-a8ad18dab3ea": "Steps to Perform Multi-digit Addition:  Align the numbers: Write the numbers in a column format, placing digits in their correct place value.  Start from the rightmost column (ones place): Add the digits in each column, moving leftward.  Carry over if needed: If the sum in any column is 10 or more, write the unit digit and carry the tens digit to the next column.  Continue adding: Repeat the process for the tens, hundreds, and higher place values until all digits are added.  Write the final sum: The result obtained after adding all digits is the sum of the given numbers.",
    "40d018cb-0266-4748-8c60-d3f73d04e064": "Multi-digit subtraction involves subtracting numbers with two or more digits by aligning them according to place value (ones, tens, hundreds, etc.). If the top digit is smaller than the bottom digit in any column, borrowing is used from the next higher place value to complete the subtraction. This method ensures accurate calculations.    In real life, multi-digit subtraction is useful in many situations. For example, if a family plans a road trip of 865 km and has already traveled 479 km, they can subtract 479 from 865 to find out how much distance is left. Similarly, if a person had ₹1,200 and spent ₹765 on shopping, subtracting helps determine how much money remains.",
    "0434a29b-8ee6-4465-8566-945861ccb5ea": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742920505/materials/materials/6ebacfb4-5f24-40ef-bfbb-6443385f0623.mp4",
    "1c2a0916-79ca-4105-a4fe-dd5fd774fa0c": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742920995/materials/materials/2034a635-b5e2-4406-884b-a99b34294e82.mp4",
    "f3277f0c-6e42-45d8-ad22-2fd6eccaaac2": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742921912/materials/materials/be8b63cd-fda9-49ad-bd98-f45cefc9ce8c.mp4",
    "c7975b18-4ab3-42cd-8367-a5947cae53c5": "# Plants are an essential part of our planet. \nThey provide us with oxygen, food, and medicine while keeping the environment clean and balanced.\nEvery plant, from the smallest grass to the tallest tree, plays a significant role in nature.\nPlants make their food through a process called photosynthesis, using sunlight, water, and air.\nThey come in different shapes and sizes, from tiny herbs to large trees.\nUnderstanding plant life helps us appreciate nature and learn how to protect our green world.",
    "e043c307-e814-4117-a1a1-473117d8790c": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742967283/materials/materials/7b98deb0-7ca7-4a8a-86b6-69adfd14bc4b.mp4",
    "72326035-6554-4d86-8f6e-ce94c02057ef": "# Plants are found everywhere on Earth.\nThey grow in forests, mountains, deserts, and even underwater.\nDifferent plants have adapted to survive in various environments. Some plants, like cactus, store water to survive in hot deserts, while others, like lotus and water lilies, float on water.\nEach plant plays an important role in maintaining the balance of nature.\nThey provide food and shelter for animals and help in reducing pollution by absorbing carbon dioxide.\nTaking care of plants and planting more trees helps in creating a healthier and greener world.",
    "6b1a9fa8-d1d9-4fd8-89a4-54662dac5d24": "Seeds are the beginning of a new plant’s life.\\n When a seed gets the right amount of water, air, and warmth, it starts to grow. This process is called germination\\n The seed absorbs water, and its outer covering, known as the seed coat, breaks open.\\nThe tiny root comes out first, growing downward to absorb water and nutrients from the soil.\\nThen, a small shoot grows upward toward the sunlight. As the plant grows, it develops leaves that help in photosynthesis, making food for the plant.\\n Over time, the small seed grows into a healthy, mature plant, continuing the cycle of life.",
    "c83385e7-314b-4c3a-9883-c3ef5677e784": "# Factors Affecting Seed Germination\\nFor a seed to grow into a healthy plant, it needs the right conditions. The three main factors that affect germination are:\\nWater – Seeds need water to soften their seed coat and activate growth.\\nAir – Oxygen helps the seed produce energy to grow.\\nWarmth – Seeds grow best at the right temperature; too much heat or cold can stop germination.\\nSome seeds also need light to sprout, while others grow better in dark soil. If any of these factors are missing, the seed may not germinate properly. Once the small roots and shoots develop, the plant starts absorbing nutrients, growing into a strong and healthy plant.",
    "8a7eadc2-fdb3-45fb-aa4f-ad96c1e784d5": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742968786/materials/materials/668c55a5-6ef4-433d-b352-dbe89b93598b.mp4",
    "23ec5f6f-7584-4369-9e18-fd7c94d58e3c": "# Body Coverings of Animals  \\nAnimals have different types of body coverings that help them survive in their environment. These coverings provide protection, warmth, and camouflage.  \\n1. Fur or Hair – Found in animals like tigers, dogs, and bears, fur keeps them warm in cold weather.\\n2. Feathers – Birds like sparrows, eagles, and peacocks have feathers to help them fly and stay warm.  \\n3. Scales – Fish and reptiles, such as snakes and lizards, have scales that protect them from water loss and injury.  \\n4. Shells – Animals like turtles and snails have hard shells to keep them safe from predators.  \\n5. Skin – Some animals, like frogs and humans, have soft skin that helps them breathe or feel their surroundings.  \\nEach body covering helps the animal adapt to its habitat and survive in nature.",
    "07257d21-02ce-4e29-88b1-f65af8264949": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742969737/materials/materials/0099f370-1055-4279-9d5f-4ff4819e49ac.mp4",
    "02555074-6216-4784-a942-b8e66f38db67": "# Importance of Body Coverings in Animals \\nAnimals' body coverings are essential for their survival, helping them in different ways.\\n1. Protection – Thick fur, hard shells, or tough scales shield animals from injuries and predators.\\n2. Camouflage – Some animals, like chameleons and tigers, have body coverings that blend with their surroundings, helping them hide from enemies or catch prey.\\n3. Temperature Control – Fur and feathers keep animals warm in winter, while scales and thin skin help cool them down in hot climates.\\n4. Waterproofing – Birds have oily feathers that prevent water from soaking them, while fish scales help them move smoothly in water.\\n5. Movement – Feathers help birds fly, smooth scales allow fish and snakes to glide easily, and soft skin helps amphibians absorb water.\\n\\nEach type of body covering plays a vital role in an animal's survival, allowing them to live and thrive in their environment.",
    "ad35d266-88eb-4ac0-b648-b6bb93de8fdc": "Here are some other important body coverings found in animals:  \\n1. Exoskeleton – Insects like grasshoppers, ants, and beetles have a hard outer covering that protects their soft bodies inside. \\n2. Spines or Quills – Animals like porcupines, sea urchins, and hedgehogs have sharp spines that help them defend against predators. \\n3. Blubber – Marine animals like whales, seals, and walruses have a thick layer of fat under their skin to keep them warm in icy waters. \\n4. Slimy Mucus – Animals like earthworms and snails produce mucus to keep their bodies moist and help them move easily. \\n5. Horn or Keratin Covering – Animals like rhinos, deer, and bulls have horns or antlers made of keratin (the same material as human nails) for protection and fighting.\\n6. Tough Plates or Armor – Animals like armadillos, pangolins, and crocodiles have bony plates that act as armor to shield them from danger. \\nThese body coverings help animals stay safe, move easily, and survive in different environments. ",
    "e470fcee-ae32-4492-b20c-ea232e23541f": "# Types of Animals Based on Their Habitat  \\nAnimals live in different places, called habitats, which provide them with food, water, and shelter. Some animals live on land, while others live in water, and some can survive in both! Based on their habitat, animals are grouped into different types.  \\n1. Terrestrial Animals – Animals that live on land, like lions, elephants, and horses. They have strong legs to walk and run.  \\n2. Aquatic Animals – Animals that live in water, like fish, dolphins, and octopuses. They have special body parts like fins or gills to help them swim and breathe.  \\n3. Amphibians – Animals that can live both on land and in water, like frogs, toads, and salamanders. They have moist skin and webbed feet to help them swim.  \\n4. Aerial Animals – Animals that spend most of their time in the air, like eagles, bats, and butterflies. They have wings and lightweight bodies to help them fly.  \\n5. Arboreal Animals – Animals that live on trees, like monkeys, squirrels, and koalas. They have strong limbs and tails to climb and hold onto branches.  \\nEach animal has special body features that help it survive in its habitat!",
    "28aab303-094e-47bf-afea-14ce3abe31df": "# How Animals Adapt to Their Habitat\\nAnimals have special features that help them live in their habitat. These features are called adaptations. Let’s see how different animals adapt to their surroundings:\\n\\nTerrestrial Animals (Land Animals)\\nCamels store fat in their humps and can survive for days without water in the desert.\\nLions have sharp claws and strong legs to catch their prey.\\nElephants have large ears to cool down their bodies in hot climates.\\n\\nAquatic Animals (Water Animals)\\nFish have gills to breathe underwater and fins to help them swim.\\nDolphins and whales have lungs and come up to the surface to breathe.\\nOctopuses can change their color to hide from predators. ",
    "cc775d3c-bd26-46b5-b035-1191e29b6581": "# Photosynthesis – How Plants Make Their Food  \\nPlants are living things that make their own food through a process called photosynthesis. This happens in the leaves using sunlight, water, and air. The green pigment called chlorophyll helps plants absorb sunlight.  \\nDuring photosynthesis:  \\n1. Leaves take in carbon dioxide from the air.  \\n2. Roots absorb water from the soil. \\n3. Sunlight provides energy for the process.  \\n\\nPlants use these to make food (glucose) and oxygen, which is released into the air. This oxygen is what we breathe! Photosynthesis is important because it gives us food and keeps the air fresh with oxygen. 🌿☀️ ",
    "f48b6974-4704-4fba-b596-fcb609d3e8f7": "# Process of Photosynthesis  \\nThe process of photosynthesis happens in the leaves of plants with the help of a green pigment called chlorophyll. It takes place in the presence of sunlight and involves three main steps:  \\n1. Absorption of Sunlight – The chlorophyll in leaves traps sunlight, which provides the energy needed for photosynthesis. \\n2. Water and Carbon Dioxide Intake –  \\n- The roots absorb water from the soil and send it to the leaves through thin tubes called xylem.\\n- The leaves take in carbon dioxide from the air through tiny openings called stomata.  \\n3. Food and Oxygen Production – Using sunlight, water, and carbon dioxide, the plant prepares food (glucose) and releases oxygen into the air.  \\nThe equation for photosynthesis is:  \\n🌞 Sunlight + 💧 Water + 🌬️ Carbon Dioxide → 🍃 Glucose (Food) + 🌿 Oxygen \\nThis process helps plants grow and provides food and oxygen for all living beings! 🌱✨ ",
    "23aa6f58-3208-4f64-9ee2-74dea333372b": "https://res.cloudinary.com/dwvejvrhd/video/upload/v1742995161/materials/materials/86b909bb-af0b-4379-a404-0b7da70ca055.mp4",
    "074078b4-d8f3-4386-b5d4-3b72a559f2a4": "# Photosynthesis in Daily Life  \\nPhotosynthesis is important for all living beings. It helps plants grow and provides us with food and oxygen. Here are some real-life examples: \\n- Food Production\\n– Fruits, vegetables, and grains like rice and wheat grow because of photosynthesis. \\n- Oxygen Supply – Plants release oxygen, which we need to breathe. \\n- Cooler Environment – Trees absorb sunlight and give us shade on hot days. \\n- Wood and Paper – Trees grow through photosynthesis, and we use them for furniture, houses, and paper. \\n- Fuels – Coal and wood, which are used as fuels, come from plants that stored the Sun’s energy.  \\nThis process keeps our planet green and full of life! 🌍🌿",
    "e368b2ff-111e-4750-b890-b5f22b627392": "# Types of Plants  \\nPlants come in different shapes, sizes, and types, depending on where they grow and how they look. Some are small and soft, while others are big and strong. Based on their size, structure, and habitat, plants are divided into different types:  \\n1. Herbs – Small, soft, and green plants like mint, coriander, and spinach.  \\n2. Shrubs – Medium-sized bushy plants with woody stems, such as rose, hibiscus, and cotton.  \\n3. Trees – Tall and strong plants with thick trunks, like mango, banyan, and coconut trees.  \\n4. Climbers – Plants with weak stems that need support to grow, like money plant and grapevine.  \\n5. Creepers – Plants that grow along the ground, such as pumpkin and watermelon.  \\nEach type of plant has special features that help it grow and survive in different environments! 🌱🌿🌳  ",
    "c1b62aef-2a50-4c6c-80bd-44781edcadfe": "# More About Types of Plants  \\nPlants not only differ in size and structure, but they also adapt to their surroundings. Some grow in water, some in deserts, and some in very cold places. Based on their habitat, plants can be further classified as:  \\n1. Aquatic Plants – Plants that grow in water, such as lotus, water lily, and hydrilla.  \\n2. Desert Plants – Plants that grow in hot and dry places, like cactus and aloe vera. They store water in their stems to survive.  \\n3. Mountain Plants – Plants that grow in cold regions, such as pine, fir, and deodar. They have needle-like leaves to protect them from snow.  \\n4. Mangrove Plants – Found in swampy areas, these plants, like sundari and mangrove trees, have special roots that help them survive in waterlogged soil.  \\n5. Grass Plants – These plants cover large areas and provide food for animals, like wheat, rice, and bamboo.  \\nEvery plant is unique and plays an important role in nature. Understanding their types helps us appreciate the beauty and importance of plants in our environment! 🌿🌎  ",
    "854419f2-f82c-4eb7-9e79-d94e5f62fae3": "# Importance of Different Types of Plants  \\nPlants are not just different in their types, but each type plays an important role in nature and in our daily lives. They provide food, shelter, and oxygen to all living beings. Here’s how different plants help us:  \\n1. Aquatic Plants – These plants keep water bodies clean and provide food for fish and other water animals. Example: lotus, water lily.  \\n2. Desert Plants – They prevent soil erosion and provide water storage in dry areas. Example: cactus, aloe vera.  \\n3. Mountain Plants – These plants help in balancing the climate and are used for making medicines and wood. Example: pine, fir.  \\n4. Mangrove Plants – They protect coastal areas from floods and strong winds. Example: mangrove trees, sundari.  \\n5. Grass Plants – These plants provide food for both humans and animals and prevent soil erosion. Example: wheat, rice, bamboo.  \\nPlants are essential for life on Earth. Protecting and growing more plants helps us maintain a healthy and green environment! 🌱🌎",
    "a47d79dc-0169-4591-a219-e7630341d0fa": "# Introduction to the Poem - \"My Shadow\"\\nThe poem \"My Shadow\" by Robert Louis Stevenson is a fascinating and imaginative poem that explores a child's curiosity about their own shadow.\\nThe poet describes how the shadow moves, grows, and changes in surprising ways, making it seem like a playful companion.\\nThrough simple yet vivid descriptions, the poem captures the wonder and innocence of childhood as the child observes their shadow with fascination.\\nThis poem helps children develop an interest in nature and science while also encouraging them to see the world with curiosity and imagination.",
    "3b46b4d0-0b9a-4612-baad-926aad123f2b": "# About the Poet - Robert Louis Stevenson\\nRobert Louis Stevenson was a famous Scottish writer and poet, best known for his adventure stories and children's poetry.\\nHe was born on November 13, 1850, in Edinburgh, Scotland, and had a great love for storytelling from a young age.\\nSome of his most famous works include \"Treasure Island,\" \"Kidnapped,\" and \"Strange Case of Dr Jekyll and Mr Hyde.\"\\nApart from novels, he also wrote beautiful poetry for children, which was compiled in his book \"A Child’s Garden of Verses.\"\\nHis poem \"My Shadow\" reflects the curiosity and imagination of childhood, making it a favorite among young readers.\\nStevenson’s writings continue to inspire and entertain people all over the world.",
    "94d7cc20-c388-4a6d-aeac-f110ba7b0255": "# Introduction to the Poem - \"The Lazy Frog\"\\nThe poem \"The Lazy Frog\" is a humorous poem that tells the story of a lazy frog named Fred.\\nFred spends his days lying on a log, avoiding work, and ignoring his mother's calls.\\nThe poem highlights the theme of laziness in a fun and entertaining way, making it enjoyable for young readers.\\nThrough Fred’s behavior, the poet humorously shows how laziness can make one unhelpful and careless towards responsibilities.\\nThis poem encourages students to be active, responsible, and helpful rather than following Fred’s lazy habits."
}